## DataFrame

## 아래와 같은 데이터프레임 df를 생성 및 출력 해보세요.

In [1]:
import pandas as pd
# 코드 작성 칸

   name  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

## age 및 children 컬럼을 선택하여 출력하세요.

In [2]:
# 코드 작성 칸

   age  children
a   24         2
b   27         1
c   34         3

## age 컬럼명을 score로 컬럼명을 변경해 주세요 
## +조건 : columns 및 inplace 매개변수 사용

In [3]:
# 코드 작성 칸

   name  score  children
a   Kim     24         2
b   Lee     27         1
c  Park     34         3

# Pandas 파일 입출력

## 모듈 import

In [4]:
from IPython.display import Image
import numpy as np
import pandas as pd

## 데이터 다운로드

In [5]:
!wget -N --http-user=mysuni --http-passwd=mysuni1! http://sk.jaen.kr:8080/seoul_transportation.xlsx

--2021-10-19 11:26:32--  http://sk.jaen.kr:8080/seoul_transportation.xlsx
Resolving sk.jaen.kr (sk.jaen.kr)... 49.247.134.238
Connecting to sk.jaen.kr (sk.jaen.kr)|49.247.134.238|:8080... connected.
HTTP request sent, awaiting response... 401 Unauthorized
Authentication selected: Basic realm="Authentication required."
Reusing existing connection to sk.jaen.kr:8080.
HTTP request sent, awaiting response... 304 Not Modified
File ‘seoul_transportation.xlsx’ not modified on server. Omitting download.

--2021-10-19 11:26:33--  http://sk.jaen.kr:8080/seoul_population.csv
Resolving sk.jaen.kr (sk.jaen.kr)... 49.247.134.238
Connecting to sk.jaen.kr (sk.jaen.kr)|49.247.134.238|:8080... connected.
HTTP request sent, awaiting response... 401 Unauthorized
Authentication selected: Basic realm="Authentication required."
Reusing existing connection to sk.jaen.kr:8080.
HTTP request sent, awaiting response... 304 Not Modified
File ‘seoul_population.csv’ not modified on server. Omitting download.

--2021-10-19 11:26:34--  http://sk.jaen.kr:8080/titanic_train.csv
Resolving sk.jaen.kr (sk.jaen.kr)... 49.247.134.238
Connecting to sk.jaen.kr (sk.jaen.kr)|49.247.134.238|:8080... connected.
HTTP request sent, awaiting response... 401 Unauthorized
Authentication selected: Basic realm="Authentication required."
Reusing existing connection to sk.jaen.kr:8080.
HTTP request sent, awaiting response... 304 Not Modified
File ‘titanic_train.csv’ not modified on server. Omitting download.

# seoul_transportation.xlsx 파일(버스 sheet만 입력)을 읽어서 df에 저장하세요.
# "XLRDError: Excel xlsx file; not supported" 에러 발생 시, 매개변수로 engine='openpyxl' 를 입력해주세요.

In [6]:
# 코드 작성 칸

# 시트명을 조회하세요.

In [7]:
# 코드 작성 칸

Index(['대중교통구분', '년월', '승차총승객수'], dtype='object')

# df를 seoul_transportation_bus.csv로 저장하세요.
# 조건 : 인덱스 없이, 구분자는 |  <- 파이프라인 = shift+역슬래시

In [8]:
# 코드 작성 칸

# Pandas 조건 정렬 조건 필터

In [10]:
import numpy as np
import pandas as pd
import seaborn as sns
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# `pclass`는 승객의 좌석등급을 나타내는 column 입니다. 좌석등급별 승객 데이터 분포를 확인해 주세요.

In [11]:
# 코드를 입력해 주세요

3    491
1    216
2    184
Name: pclass, dtype: int64

# sort_values 함수를 활용해 'age:내림차순', 'fare:오름차순' 순으로 정렬하세요.

In [12]:
# 코드를 입력해 주세요

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [1]:
# DataFrame
## 1-1. 아래와 같은 데이터프레임 df를 생성 및 출력 해보세요.

import pandas as pd
# 코드 작성 칸

#	name	age	children
# a	Kim	24	2
# b	Lee	27	1
# c	Park	34	3


====
## 1-2. age 및 children 컬럼을 선택하여 출력하세요.
# 코드 작성 칸

# 	age	children
# a	24	2
# b	27	1
# c	34	3



====
## 1-3. age 컬럼명을 score로 컬럼명을 변경해 주세요 
## +조건 : columns 및 inplace 매개변수 사용
# 코드 작성 칸

# 	name	score	children
# a	Kim	24	2
# b	Lee	27	1
# c	Park	34	3





====
# Pandas 파일 입출력
## 모듈 import
from IPython.display import Image
import numpy as np
import pandas as pd
## 데이터 다운로드
!wget -N --http-user=mysuni --http-passwd=mysuni1! http://sk.jaen.kr:8080/seoul_transportation.xlsx


# 2-1. seoul_transportation.xlsx 파일(버스 sheet만 입력)을 읽어서 df에 저장하세요.
# "XLRDError: Excel xlsx file; not supported" 에러 발생 시, 매개변수로 engine='openpyxl' 를 입력해주세요.
# 코드 작성 칸


====
# 2-2. 시트명을 조회하세요.
# 코드 작성 칸


====
# 2-3. df를 seoul_transportation_bus.csv로 저장하세요.
# 조건 : 인덱스 없이, 구분자는 |  <-역슬래시
# 코드 작성 칸









====
# Pandas 조건 정렬 조건 필터
import numpy as np
import pandas as pd
import seaborn as sns
df = sns.load_dataset("titanic")
df.head()
# survived	pclass	sex	age	sibsp	parch	fare	embarked	class	who	adult_male	deck	embark_town	alive	alone
# 0	0	3	male	22.0	1	0	7.2500	S	Third	man	True	NaN	Southampton	no	False
# 1	1	1	female	38.0	1	0	71.2833	C	First	woman	False	C	Cherbourg	yes	False
# 2	1	3	female	26.0	0	0	7.9250	S	Third	woman	False	NaN	Southampton	yes	True
# 3	1	1	female	35.0	1	0	53.1000	S	First	woman	False	C	Southampton	yes	False
# 4	0	3	male	35.0	0	0	8.0500	S	Third	man	True	NaN	Southampton	no	True



====
# 3-1.`pclass`는 승객의 좌석등급을 나타내는 column 입니다. 좌석등급별 승객 데이터 분포를 확인해 주세요.
# 코드를 입력해 주세요

# 3    491
# 1    216
# 2    184
# Name: pclass, dtype: int64



====
# 3-2. sort_values 함수를 활용해 'age:내림차순', 'fare:오름차순' 순으로 정렬하세요.
# 코드를 입력해 주세요

# 	survived	pclass	sex	age	sibsp	parch	fare	embarked	class	who	adult_male	deck	embark_town	alive	alone
# 630	1	1	male	80.0	0	0	30.0000	S	First	man	True	A	Southampton	yes	True
# 851	0	3	male	74.0	0	0	7.7750	S	Third	man	True	NaN	Southampton	no	True
# 96	0	1	male	71.0	0	0	34.6542	C	First	man	True	A	Cherbourg	no	True
# 493	0	1	male	71.0	0	0	49.5042	C	First	man	True	NaN	Cherbourg	no	True
# 116	0	3	male	70.5	0	0	7.7500	Q	Third	man	True	NaN	Queenstown	no	True

SyntaxError: invalid syntax (<ipython-input-1-f3537158a2d7>, line 13)